In [1]:
import pandas as pd
from sqlalchemy import create_engine, MetaData, Table
import psycopg2
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()
from sqlalchemy import Column, Integer, String, Float
import psycopg2

In [2]:
#Create an engine to connect  the local postgres database
connection_string = "postgres:postgres@localhost:5432/guns_db"
engine = create_engine(f'postgresql://{connection_string}')

In [3]:
#Check the schemas of the database
engine.table_names()

<ipython-input-3-610615512440>:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['2016poverty',
 '2016_gun_violence',
 '2017_gun_violence',
 'totalpopulation',
 '2017poverty',
 'merged_data']

In [4]:
#Import csv files
guns_2016 = pd.read_csv('Resources/2016_gun_violence.csv')
guns_2017 = pd.read_csv('Resources/2017_gun_violence.csv')
population = pd.read_csv('Resources/population_clean.csv')
poverty_2016 = pd.read_csv('Resources/poverty_2016_clean.csv')
poverty_2017 = pd.read_csv('Resources/poverty_2017_clean.csv')

In [5]:
#Create a new index
guns_2016 = guns_2016.reset_index(inplace=False)
guns_2016 = guns_2016.rename(columns={'index': 'id'})
guns_2016.head()

   id          state  n_killed  n_injured
0   0        Alabama       488        761
1   1          Maine        18         37
2   2       Maryland       429        748
3   3  Massachusetts       112        468
4   4       Michigan       385        700

In [ ]:
#Export the dataframe to the pgAdmin database table
guns_2016.to_sql(name="2016_gun_violence", con=engine, if_exists='append', index=False)

In [6]:
#Do the same steps for the 2017 data
guns_2017 = guns_2016.reset_index(inplace=False)
guns_2017 = guns_2016.rename(columns={'index': 'id'})
guns_2017.head()

   id          state  n_killed  n_injured
0   0        Alabama       488        761
1   1          Maine        18         37
2   2       Maryland       429        748
3   3  Massachusetts       112        468
4   4       Michigan       385        700

In [ ]:
guns_2017.to_sql(name="2017_gun_violence", con=engine, if_exists='append', index=False)

In [7]:
# Rename the id column to id in order to match the scema in pgAdmin
population = population.rename(columns={'Unnamed: 0': 'id'})
population.head()

   id  rank         state  population  density_per_sq_mi
0   0     1    California    39461588           254.2929
1   1     2         Texas    28628666           113.8081
2   2     3       Florida    21244317           409.2229
3   3     4      New York    19530351           409.5400
4   4     5  Pennsylvania    12800922           286.1704

In [ ]:
#Export the data into pgAdmin database table
population.to_sql(name="totalpopulation", con=engine, if_exists='append', index=False)

In [8]:
poverty_2016.head()

,Unnamed: 0,Location,White,Black,Hispanic,Asian/Native Hawaiian and Pacific Islander,American Indian/Alaska Native,Multiple Races,Total
0,0,United States,0.100,0.238,0.210,0.120,0.273,0.174,0.141
1,1,Alabama,0.121,0.279,0.319,0.118,0.126,0.251,0.173
2,2,Alaska,0.068,0.000,0.178,0.000,0.274,0.104,0.106
3,3,Arizona,0.110,0.211,0.238,0.136,0.360,0.155,0.165
4,4,Arkansas,0.138,0.288,0.255,0.129,0.263,0.254,0.172

In [9]:
# Here we put an index column and renamed it to id. We alos dropped an unnecesart 'Unnamed: 0' column and chaged the
# name 'location' of a column to state to be consistant with other dataframes
poverty_2016 = poverty_2016.reset_index(inplace=False)
poverty_2016 = poverty_2016.rename(columns={'index': 'id'})
poverty_2016 = poverty_2016.drop(['Unnamed: 0'], axis=1)
poverty_2016 = poverty_2016.rename(columns={'Location': 'state'})
poverty_2016.head()

,id,state,White,Black,Hispanic,Asian/Native Hawaiian and Pacific Islander,American Indian/Alaska Native,Multiple Races,Total
0,0,United States,0.100,0.238,0.210,0.120,0.273,0.174,0.141
1,1,Alabama,0.121,0.279,0.319,0.118,0.126,0.251,0.173
2,2,Alaska,0.068,0.000,0.178,0.000,0.274,0.104,0.106
3,3,Arizona,0.110,0.211,0.238,0.136,0.360,0.155,0.165
4,4,Arkansas,0.138,0.288,0.255,0.129,0.263,0.254,0.172

In [ ]:
#Export the data into pgAdmin database table
poverty_2016.to_sql(name="2016poverty", con=engine, if_exists='append', index=False)

In [10]:
poverty_2017.head()

,Unnamed: 0,Location,White,Black,Hispanic,Asian/Native Hawaiian and Pacific Islander,American Indian/Alaska Native,Multiple Races,Total
0,0,United States,0.096,0.229,0.193,0.112,0.262,0.159,0.134
1,1,Alabama,0.117,0.269,0.306,0.193,0.000,0.239,0.168
2,2,Alaska,0.083,0.000,0.000,0.000,0.246,0.112,0.117
3,3,Arizona,0.101,0.230,0.197,0.109,0.360,0.143,0.147
4,4,Arkansas,0.130,0.278,0.237,0.150,0.284,0.163,0.162

In [11]:
#Renamed a column to id
poverty_2017 = poverty_2017.rename(columns={'Unnamed: 0': 'id', 'Location': 'state'})

In [ ]:
#Export the data into pgAdmin database table
poverty_2017.to_sql(name="2017poverty", con=engine, if_exists='append', index=False)